app/controllers/assessmentforms_controller.rb

SELECT * FROM `assessmentforms`
---
  def index
    @assessmentforms = Assessmentform.all

SELECT * FROM `assessmentforms` WHERE (`assessmentforms`.`id` = 2)
---
  def show
    @assessmentform = Assessmentform.find(params[:id])

INSERT INTO `assessmentforms` (`city`, `created_at`, `zip_code`, `comments`, `updated_at`, `subject_id`, `address_1`, `last_name`, `phone`, `address_2`, `first_name`, `email`, `state`) VALUES('Westwood', '2010-03-27 04:50:41', '07675', 'Nice comments', '2010-03-27 04:50:41', 1, '2 High Street Apt B', 'gote', '732 9107261', '2 High Street Apt B', 'mohan', 'mgflexas@gmail.com', 'NJ')
---
  def create
    @assessmentform = Assessmentform.new(params[:assessmentform])
    if @assessmentform.save

SELECT * FROM `assessmentforms` WHERE (`assessmentforms`.`id` = 1)
---
  def edit
    @assessmentform = Assessmentform.find(params[:id])

SELECT * FROM `assessmentforms` WHERE (`assessmentforms`.`id` = 1)
UPDATE `assessmentforms` SET `updated_at` = '2010-03-28 23:40:54', `last_name` = 'Good Boy', `first_name` = 'Atharva ' WHERE `id` = 6
---
  def update
    @assessmentform = Assessmentform.find(params[:id])
    if @assessmentform.update_attributes(params[:assessmentform])

SELECT * FROM `assessmentforms` WHERE (`assessmentforms`.`id` = 6)
DELETE FROM `assessmentforms` WHERE `id` = 6
---
  def destroy
    @assessmentform = Assessmentform.find(params[:id])
    @assessmentform.destroy