app/controllers/subjects_controller.rb

SELECT * FROM `subjects`
---
  def index
    @subjects = Subject.all

SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)
---
  def show
    @subject = Subject.find(params[:id])

INSERT INTO `subjects` (`name`, `created_at`, `updated_at`) VALUES('Flex', '2010-03-26 19:31:03', '2010-03-26 19:31:03')
---
  def create
    @subject = Subject.new(params[:subject])
    if @subject.save

SELECT * FROM "subjects" WHERE ("subjects"."id" = 6)
---
  def edit
    @subject = Subject.find(params[:id])

SELECT * FROM "subjects" WHERE ("subjects"."id" = 6)
UPDATE "subjects" SET "updated_at" = '2010-03-26 16:13:50', "name" = 'InDesign' WHERE "id" = 6
---
  def update
    @subject = Subject.find(params[:id])
    if @subject.update_attributes(params[:subject])